app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM `messages`

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1)

  def create
    @message = Message.new(params[:message])
    @message.user_agent = request.env["HTTP_USER_AGENT"].split(" ").first
    @message.user_id = current_user.id

    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`created_at`, `body`, `updated_at`, `user_id`, `user_agent`) VALUES('2009-12-10 14:53:55', 'Bonjour', '2009-12-10 14:53:55', 1, '')

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 3)
DELETE FROM `messages` WHERE `id` = 3