app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('JJoT3QKA_t0rwJwNh7yx', '2009-12-03 15:03:44', '2009-12-03 15:03:44', '65119120732cd3f844b79162b9fc9241551c2d28e4553745ba7795d841da3e695bb37d47c189a1c9c9c42a8952c23c6413403e96a15864c1e63ef2a13b2a7d6e', 'zALg7lrjuhj_kyxO6XRS', '2009-12-03 15:03:44', 0, '130.79.7.1', '0TRfd7voAKL1hob7QbeF', '2009-12-03 15:03:44', '7a15e667eec9ceee9b0a76361cc8bbd660ef987a4aff5966ae50727c710f46379a7ed04a05690185fa05bab096bc70d102276ab5d5786db94bc4285047551ac2', 1, NULL, 'Angus', NULL, 'ncronimus@coop-alsace.fr')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`login` = 'angus') LIMIT 1
SELECT * FROM `messages` WHERE (`messages`.user_id = 1) ORDER BY messages.created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages` WHERE (`messages`.user_id = 1)
---
  def show
    @message = Message.new
    @user = User.find_by_login(params[:id])
    @messages = @user.messages.paginate(:page => params[:page], :per_page => 5, :order => 'messages.created_at DESC')

SELECT * FROM `messages` ORDER BY messages.created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages`
---
  def index
    @messages = Message.paginate(:page => params[:page], :per_page => 5, :order => 'messages.created_at DESC')

UPDATE `users` SET `updated_at` = '2009-12-03 15:32:51', `crypted_password` = 'a2a5ad3bdd109bc3629fcd54dc0897916d66379105a47286de2c32a1d85f7fb3ad3d16abaf954bc75a6fe0dcbb39f338afe09b7d0d8022eb9e42e51e70703c10', `perishable_token` = 'CtnwJkUNFCfvoTCjKgpp', `last_login_at` = '2009-12-03 15:03:44', `last_login_ip` = '130.79.7.1', `current_login_at` = '2009-12-03 15:32:51', `password_salt` = '1gbzVT2eSnPVRDcsYUKX', `login_count` = 2, `persistence_token` = '3499ab351a5accb71fa5149375be765f5ca7abb3402d8df900c600674ef8da48fd9c4cdc70d2d640f66ae7cc1a07aca866a2bda939ec3c369ac7a47296dce9f6', `last_request_at` = '2009-12-03 15:32:51' WHERE `id` = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])